backend/tests/load/auth.yml
# Artillery load test: auth endpoints
# Run: npx artillery run backend/tests/load/auth.yml --output tests/load/reports/auth.json
#
# Users: loadtest01-05@gmail.com / Password@123
# First run creates them automatically. Subsequent runs reuse them.
#
# Each VU sends a unique X-Forwarded-For so it gets its own rate-limit bucket
# in Redis. Relies on trust proxy being set.
#
# Thresholds: p99 < 300ms, error rate < 0.5%

config:
  target: "http://localhost:8000"
  phases:
    - name: "warm"
      duration: 30
      arrivalRate: 10
    - name: "ramp"
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: "sustained"
      duration: 60
      arrivalRate: 50
  ensure:
    thresholds:
      - http.response_time.p99: 300
    conditions:
      - expression: "(http.codes.5xx / http.requests) < 0.005"
        strict: false

# Each scenario:
#   1. Registers the fixed test user, with no status expectation: 201 on the
#      first run, 409 after. A fixed IP per user isolates the register limit.
#   2. Logs in with a random IP so every VU gets its own rate-limit window.

scenarios:
  - name: "loadtest01"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/register"
          headers:
            X-Forwarded-For: "10.0.0.1"
          json:
            name: "Load Test 01"
            email: "loadtest01@gmail.com"
            password: "Password@123"
      - post:
          url: "/api/v1/auth/login"
          headers:
            X-Forwarded-For: "10.1.{{ $randomInt(0, 255) }}.{{ $randomInt(0, 255) }}"
          json:
            email: "loadtest01@gmail.com"
            password: "Password@123"
          expect:
            - statusCode: 200

  - name: "loadtest02"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/register"
          headers:
            X-Forwarded-For: "10.0.0.2"
          json:
            name: "Load Test 02"
            email: "loadtest02@gmail.com"
            password: "Password@123"
      - post:
          url: "/api/v1/auth/login"
          headers:
            X-Forwarded-For: "10.2.{{ $randomInt(0, 255) }}.{{ $randomInt(0, 255) }}"
          json:
            email: "loadtest02@gmail.com"
            password: "Password@123"
          expect:
            - statusCode: 200

  - name: "loadtest03"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/register"
          headers:
            X-Forwarded-For: "10.0.0.3"
          json:
            name: "Load Test 03"
            email: "loadtest03@gmail.com"
            password: "Password@123"
      - post:
          url: "/api/v1/auth/login"
          headers:
            X-Forwarded-For: "10.3.{{ $randomInt(0, 255) }}.{{ $randomInt(0, 255) }}"
          json:
            email: "loadtest03@gmail.com"
            password: "Password@123"
          expect:
            - statusCode: 200

  - name: "loadtest04"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/register"
          headers:
            X-Forwarded-For: "10.0.0.4"
          json:
            name: "Load Test 04"
            email: "loadtest04@gmail.com"
            password: "Password@123"
      - post:
          url: "/api/v1/auth/login"
          headers:
            X-Forwarded-For: "10.4.{{ $randomInt(0, 255) }}.{{ $randomInt(0, 255) }}"
          json:
            email: "loadtest04@gmail.com"
            password: "Password@123"
          expect:
            - statusCode: 200

  - name: "loadtest05"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/register"
          headers:
            X-Forwarded-For: "10.0.0.5"
          json:
            name: "Load Test 05"
            email: "loadtest05@gmail.com"
            password: "Password@123"
      - post:
          url: "/api/v1/auth/login"
          headers:
            X-Forwarded-For: "10.5.{{ $randomInt(0, 255) }}.{{ $randomInt(0, 255) }}"
          json:
            email: "loadtest05@gmail.com"
            password: "Password@123"
          expect:
            - statusCode: 200