backend/tests/load/ingestion-heavy.yml
# Artillery load test: ingestion /track — Heavy
# Target: 10,000 RPS → p99 < 1s, error rate < 1%
#
# Single Artillery process tops out ~2-3k RPS.
# Run with multiple workers:
#   npx artillery run --workers 8 tests/load/ingestion-heavy.yml
# Or distributed mode:
#   npx artillery run-distributed tests/load/ingestion-heavy.yml
#
# Prereq: data/users.csv must exist (pnpm load:seed)

config:
  target: "http://localhost:8000"
  payload:
    path: "./data/users.csv"
    fields:
      - email
      - password
      - siteId
      - trackingId
    order: random
  phases:
    - name: "ramp"
      duration: 120
      arrivalRate: 1000
      rampTo: 10000
    - name: "sustained"
      duration: 1200
      arrivalRate: 10000
  ensure:
    thresholds:
      - http.response_time.p99: 1000
    conditions:
      - expression: "(http.codes.5xx / http.requests) < 0.01"
        strict: false

scenarios:
  - name: "Track PAGEVIEW"
    weight: 7
    flow:
      - post:
          url: "/api/v1/track?v=1&tid={{ trackingId }}&t=PAGEVIEW&cid={{ $uuid }}&sid={{ $uuid }}&dl=https%3A%2F%2Fexample.com%2Fproducts%2F{{ $randomInt(1,500) }}&dt=Product%20Page&dr=https%3A%2F%2Fwww.google.com&sr=1920x1080&vp=1024x768&ul=en-US"
          headers:
            X-Forwarded-For: "{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}"

  - name: "Track CLICK"
    weight: 2
    flow:
      - post:
          url: "/api/v1/track?v=1&tid={{ trackingId }}&t=CLICK&cid={{ $uuid }}&sid={{ $uuid }}&dl=https%3A%2F%2Fexample.com%2F&en=button_click&ep=%7B%22label%22%3A%22signup%22%7D"
          headers:
            X-Forwarded-For: "{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}"

  - name: "Track CUSTOM"
    weight: 1
    flow:
      - post:
          url: "/api/v1/track?v=1&tid={{ trackingId }}&t=CUSTOM&cid={{ $uuid }}&sid={{ $uuid }}&dl=https%3A%2F%2Fexample.com%2Fcheckout&en=purchase&ep=%7B%22value%22%3A49.99%7D"
          headers:
            X-Forwarded-For: "{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}.{{ $randomInt(1,254) }}"